UniSwarm/uDevkit-SDK/support/driver/adc/adc_dspic33_sar12.h
/**
 * @file adc_dspic33_sar12.h
 * @author Sebastien CAUX (sebcaux)
 * @copyright UniSwarm 2018-2023
 *
 * @date December 13, 2018, 09:26 AM
 *
 * @brief ADC driver support for dsPIC33E GS, dsPIC33CK and dsPIC33CH
 *
 * Implementation based on Microchip document DS70005213G :
 *  http://ww1.microchip.com/downloads/en/DeviceDoc/dsPIC33-PIC24-FRM,-12-Bit-High-Speed,-Multiple-SARs-ADC-Converter-DS70005213G.pdf
 */

#ifndef ADC_DSPIC33_SAR12_H
#define ADC_DSPIC33_SAR12_H

#ifdef __cplusplus
extern "C" {
#endif

volatile int16_t *adc_buffAddr(uint8_t channel);

#define ADC_MAX_RESOLUTION_BIT 12

// ====================================== Channel availability ======================================
#if defined(DEVICE_33CDV64MC106) || defined(DEVICE_33CDVL64MC106) || defined(DEVICE_33CK32MC103) || defined(DEVICE_33CK32MC105) || defined(DEVICE_33CK64MC103) \
    || defined(DEVICE_33CK64MC105)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_MASK 0x0003FFFFLU
#    define ADC_CHANNEL_COUNT     18
#    define ADC_CHANNEL_MAX       17
#elif defined(DEVICE_33CDV128MP206) || defined(DEVICE_33CDV128MP506) || defined(DEVICE_33CDV256MP206) || defined(DEVICE_33CDV256MP506)                         \
    || defined(DEVICE_33CDVC128MP506) || defined(DEVICE_33CDVC256MP506) || defined(DEVICE_33CK32MP206) || defined(DEVICE_33CK32MP506)                          \
    || defined(DEVICE_33CK64MP206) || defined(DEVICE_33CK64MP506) || defined(DEVICE_33CK128MP206) || defined(DEVICE_33CK128MP506)                              \
    || defined(DEVICE_33CK256MP206) || defined(DEVICE_33CK256MP506)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_MASK 0x030FFFFFLU
#    define ADC_CHANNEL_COUNT     22
#    define ADC_CHANNEL_MAX       25
#elif defined(DEVICE_33CH64MP202) || defined(DEVICE_33CH64MP502) || defined(DEVICE_33CH128MP202) || defined(DEVICE_33CH128MP502)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x001F0FFFLU
#    define ADC_CHANNEL_COUNT     17
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CH64MP202S1) || defined(DEVICE_33CH64MP502S1) || defined(DEVICE_33CH128MP202S1) || defined(DEVICE_33CH128MP502S1)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x001D82FFLU
#    define ADC_CHANNEL_COUNT     14
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CH64MP203) || defined(DEVICE_33CH64MP503) || defined(DEVICE_33CH128MP203) || defined(DEVICE_33CH128MP503)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x001F7FFFLU
#    define ADC_CHANNEL_COUNT     20
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CH64MP203S1) || defined(DEVICE_33CH64MP503S1) || defined(DEVICE_33CH128MP203S1) || defined(DEVICE_33CH128MP503S1)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x001D87FFLU
#    define ADC_CHANNEL_COUNT     16
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CH64MP205) || defined(DEVICE_33CH64MP206) || defined(DEVICE_33CH64MP206S1) || defined(DEVICE_33CH64MP208)                               \
    || defined(DEVICE_33CH64MP208S1) || defined(DEVICE_33CH64MP505) || defined(DEVICE_33CH64MP506) || defined(DEVICE_33CH64MP506S1)                            \
    || defined(DEVICE_33CH64MP508) || defined(DEVICE_33CH64MP508S1) || defined(DEVICE_33CH128MP205) || defined(DEVICE_33CH128MP206)                            \
    || defined(DEVICE_33CH128MP206S1) || defined(DEVICE_33CH128MP208) || defined(DEVICE_33CH128MP208S1) || defined(DEVICE_33CH128MP505)                        \
    || defined(DEVICE_33CH128MP506) || defined(DEVICE_33CH128MP506S1) || defined(DEVICE_33CH128MP508) || defined(DEVICE_33CH128MP508S1)                        \
    || defined(DEVICE_33CH256MP205) || defined(DEVICE_33CH256MP206) || defined(DEVICE_33CH256MP206S1) || defined(DEVICE_33CH256MP208)                          \
    || defined(DEVICE_33CH256MP208S1) || defined(DEVICE_33CH256MP218) || defined(DEVICE_33CH256MP218S1) || defined(DEVICE_33CH256MP505)                        \
    || defined(DEVICE_33CH256MP506) || defined(DEVICE_33CH256MP506S1) || defined(DEVICE_33CH256MP508) || defined(DEVICE_33CH256MP508S1)                        \
    || defined(DEVICE_33CH512MP205) || defined(DEVICE_33CH512MP206) || defined(DEVICE_33CH512MP206S1) || defined(DEVICE_33CH512MP208)                          \
    || defined(DEVICE_33CH512MP208S1) || defined(DEVICE_33CH512MP505) || defined(DEVICE_33CH512MP506) || defined(DEVICE_33CH512MP506S1)                        \
    || defined(DEVICE_33CH512MP508) || defined(DEVICE_33CH512MP508S1) || defined(DEVICE_33CK32MP105) || defined(DEVICE_33CK64MP105)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x001FFFFFLU
#    define ADC_CHANNEL_COUNT     21
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CH64MP205S1) || defined(DEVICE_33CH64MP505S1) || defined(DEVICE_33CH128MP205S1) || defined(DEVICE_33CH128MP505S1)                       \
    || defined(DEVICE_33CH256MP205S1) || defined(DEVICE_33CH256MP505S1) || defined(DEVICE_33CH512MP205S1) || defined(DEVICE_33CH512MP505S1)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x001DBFFFLU
#    define ADC_CHANNEL_COUNT     19
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CH512MP305) || defined(DEVICE_33CH512MP305S1) || defined(DEVICE_33CH512MP405) || defined(DEVICE_33CH512MP405S1)                         \
    || defined(DEVICE_33CH512MP605) || defined(DEVICE_33CH512MP605S1) || defined(DEVICE_33CH512MP705) || defined(DEVICE_33CH512MP705S1)                        \
    || defined(DEVICE_33CH1024MP305) || defined(DEVICE_33CH1024MP305S1) || defined(DEVICE_33CH1024MP405) || defined(DEVICE_33CH1024MP405S1)                    \
    || defined(DEVICE_33CH1024MP605) || defined(DEVICE_33CH1024MP605S1) || defined(DEVICE_33CH1024MP705) || defined(DEVICE_33CH1024MP705S1)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_MASK 0x1F00FFFFLU
#    define ADC_CHANNEL_COUNT     21
#    define ADC_CHANNEL_MAX       28
#elif defined(DEVICE_33CH512MP306) || defined(DEVICE_33CH512MP306S1) || defined(DEVICE_33CH512MP406) || defined(DEVICE_33CH512MP406S1)                         \
    || defined(DEVICE_33CH512MP606) || defined(DEVICE_33CH512MP606S1) || defined(DEVICE_33CH512MP706) || defined(DEVICE_33CH512MP706S1)                        \
    || defined(DEVICE_33CH1024MP306) || defined(DEVICE_33CH1024MP306S1) || defined(DEVICE_33CH1024MP406) || defined(DEVICE_33CH1024MP406S1)                    \
    || defined(DEVICE_33CH1024MP606) || defined(DEVICE_33CH1024MP606S1) || defined(DEVICE_33CH1024MP706) || defined(DEVICE_33CH1024MP706S1)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_MASK 0x1F02FFFFLU
#    define ADC_CHANNEL_COUNT     22
#    define ADC_CHANNEL_MAX       28
#elif defined(DEVICE_33CH512MP308) || defined(DEVICE_33CH512MP308S1) || defined(DEVICE_33CH512MP408) || defined(DEVICE_33CH512MP408S1)                         \
    || defined(DEVICE_33CH512MP608) || defined(DEVICE_33CH512MP608S1) || defined(DEVICE_33CH512MP708) || defined(DEVICE_33CH512MP708S1)                        \
    || defined(DEVICE_33CH1024MP308) || defined(DEVICE_33CH1024MP308S1) || defined(DEVICE_33CH1024MP408) || defined(DEVICE_33CH1024MP408S1)                    \
    || defined(DEVICE_33CH1024MP608) || defined(DEVICE_33CH1024MP608S1) || defined(DEVICE_33CH1024MP708) || defined(DEVICE_33CH1024MP708S1)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_MASK 0x1F0AFFFFLU
#    define ADC_CHANNEL_COUNT     23
#    define ADC_CHANNEL_MAX       28
#elif defined(DEVICE_33CH512MP410) || defined(DEVICE_33CH512MP410S1) || defined(DEVICE_33CH512MP412) || defined(DEVICE_33CH512MP412S1)                         \
    || defined(DEVICE_33CH512MP710) || defined(DEVICE_33CH512MP710S1) || defined(DEVICE_33CH512MP712) || defined(DEVICE_33CH512MP712S1)                        \
    || defined(DEVICE_33CH1024MP410) || defined(DEVICE_33CH1024MP410S1) || defined(DEVICE_33CH1024MP412) || defined(DEVICE_33CH1024MP412S1)                    \
    || defined(DEVICE_33CH1024MP710) || defined(DEVICE_33CH1024MP710S1) || defined(DEVICE_33CH1024MP712) || defined(DEVICE_33CH1024MP712S1)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_CH22
#    define ADC_CHANNEL_HAVE_CH23
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_MASK 0x1FFFFFFFLU
#    define ADC_CHANNEL_COUNT     29
#    define ADC_CHANNEL_MAX       28
#elif defined(DEVICE_33CK32MC102) || defined(DEVICE_33CK64MC102)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_MASK 0x00030FFFLU
#    define ADC_CHANNEL_COUNT     14
#    define ADC_CHANNEL_MAX       17
#elif defined(DEVICE_33CK32MP102) || defined(DEVICE_33CK64MP102)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x00180FFFLU
#    define ADC_CHANNEL_COUNT     14
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CK32MP103) || defined(DEVICE_33CK64MP103)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_MASK 0x0018FFFFLU
#    define ADC_CHANNEL_COUNT     18
#    define ADC_CHANNEL_MAX       20
#elif defined(DEVICE_33CK32MP202) || defined(DEVICE_33CK32MP502) || defined(DEVICE_33CK64MP202) || defined(DEVICE_33CK64MP502) || defined(DEVICE_33CK128MP202) \
    || defined(DEVICE_33CK128MP502) || defined(DEVICE_33CK256MP202) || defined(DEVICE_33CK256MP502)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_MASK 0x03000FFFLU
#    define ADC_CHANNEL_COUNT     14
#    define ADC_CHANNEL_MAX       25
#elif defined(DEVICE_33CK32MP203) || defined(DEVICE_33CK32MP503) || defined(DEVICE_33CK64MP203) || defined(DEVICE_33CK64MP503) || defined(DEVICE_33CK128MP203) \
    || defined(DEVICE_33CK128MP503) || defined(DEVICE_33CK256MP203) || defined(DEVICE_33CK256MP503)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_MASK 0x0300FFFFLU
#    define ADC_CHANNEL_COUNT     18
#    define ADC_CHANNEL_MAX       25
#elif defined(DEVICE_33CK32MP205) || defined(DEVICE_33CK32MP505) || defined(DEVICE_33CK64MP205) || defined(DEVICE_33CK64MP505) || defined(DEVICE_33CK128MP205) \
    || defined(DEVICE_33CK128MP505) || defined(DEVICE_33CK256MP205) || defined(DEVICE_33CK256MP505)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_MASK 0x0307FFFFLU
#    define ADC_CHANNEL_COUNT     21
#    define ADC_CHANNEL_MAX       25
#elif defined(DEVICE_33CK64MP208) || defined(DEVICE_33CK64MP508) || defined(DEVICE_33CK128MP208) || defined(DEVICE_33CK128MP508)                               \
    || defined(DEVICE_33CK256MP208) || defined(DEVICE_33CK256MP508)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_CH22
#    define ADC_CHANNEL_HAVE_CH23
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_MASK 0x03FFFFFFLU
#    define ADC_CHANNEL_COUNT     26
#    define ADC_CHANNEL_MAX       25
#elif defined(DEVICE_33CK128MC102) || defined(DEVICE_33CK128MC502) || defined(DEVICE_33CK256MC102) || defined(DEVICE_33CK256MC502)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x00330F7FLU
#    define ADC_CHANNEL_COUNT     15
#    define ADC_CHANNEL_MAX       21
#elif defined(DEVICE_33CK128MC103) || defined(DEVICE_33CK128MC503) || defined(DEVICE_33CK256MC103) || defined(DEVICE_33CK256MC503)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x0033FF7FLU
#    define ADC_CHANNEL_COUNT     19
#    define ADC_CHANNEL_MAX       21
