UniSwarm/uDevkit-SDK/support/driver/adc/adc_dspic33_sar12.h
#elif defined(DEVICE_33CK128MC105) || defined(DEVICE_33CK128MC106) || defined(DEVICE_33CK128MC505) || defined(DEVICE_33CK128MC506)                             \
    || defined(DEVICE_33CK256MC105) || defined(DEVICE_33CK256MC106) || defined(DEVICE_33CK256MC505) || defined(DEVICE_33CK256MC506)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x003FFFFFLU
#    define ADC_CHANNEL_COUNT     22
#    define ADC_CHANNEL_MAX       21
#elif defined(DEVICE_33CK256MP305) || defined(DEVICE_33CK256MP605) || defined(DEVICE_33CK512MP305) || defined(DEVICE_33CK512MP605)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_MASK 0x0F07FFFFLU
#    define ADC_CHANNEL_COUNT     23
#    define ADC_CHANNEL_MAX       27
#elif defined(DEVICE_33CK256MP306) || defined(DEVICE_33CK256MP606) || defined(DEVICE_33CK512MP306) || defined(DEVICE_33CK512MP606)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_MASK 0x0F0FFFFFLU
#    define ADC_CHANNEL_COUNT     24
#    define ADC_CHANNEL_MAX       27
#elif defined(DEVICE_33CK256MP308) || defined(DEVICE_33CK256MP608) || defined(DEVICE_33CK256MPT608) || defined(DEVICE_33CK512MP308)                            \
    || defined(DEVICE_33CK512MP608) || defined(DEVICE_33CK512MPT608)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_CH22
#    define ADC_CHANNEL_HAVE_CH23
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_MASK 0x0FFFFFFFLU
#    define ADC_CHANNEL_COUNT     28
#    define ADC_CHANNEL_MAX       27
#elif defined(DEVICE_33CK256MP405) || defined(DEVICE_33CK256MP705) || defined(DEVICE_33CK512MP405) || defined(DEVICE_33CK512MP705)                             \
    || defined(DEVICE_33CK1024MP405) || defined(DEVICE_33CK1024MP705)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_CH29
#    define ADC_CHANNEL_HAVE_CH30
#    define ADC_CHANNEL_HAVE_CH31
#    define ADC_CHANNEL_HAVE_MASK 0xF807FFFFLU
#    define ADC_CHANNEL_COUNT     24
#    define ADC_CHANNEL_MAX       31
#elif defined(DEVICE_33CK256MP406) || defined(DEVICE_33CK256MP706) || defined(DEVICE_33CK512MP406) || defined(DEVICE_33CK512MP706)                             \
    || defined(DEVICE_33CK1024MP406) || defined(DEVICE_33CK1024MP706)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_CH29
#    define ADC_CHANNEL_HAVE_CH30
#    define ADC_CHANNEL_HAVE_CH31
#    define ADC_CHANNEL_HAVE_MASK 0xF80FFFFFLU
#    define ADC_CHANNEL_COUNT     25
#    define ADC_CHANNEL_MAX       31
#elif defined(DEVICE_33CK256MP408) || defined(DEVICE_33CK256MP708) || defined(DEVICE_33CK512MP408) || defined(DEVICE_33CK512MP708)                             \
    || defined(DEVICE_33CK1024MP408) || defined(DEVICE_33CK1024MP708)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_CH22
#    define ADC_CHANNEL_HAVE_CH23
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_CH29
#    define ADC_CHANNEL_HAVE_CH30
#    define ADC_CHANNEL_HAVE_CH31
#    define ADC_CHANNEL_HAVE_MASK 0xF8FFFFFFLU
#    define ADC_CHANNEL_COUNT     29
#    define ADC_CHANNEL_MAX       31
#elif defined(DEVICE_33CK256MP410) || defined(DEVICE_33CK256MP710) || defined(DEVICE_33CK512MP410) || defined(DEVICE_33CK512MP710)                             \
    || defined(DEVICE_33CK1024MP410) || defined(DEVICE_33CK1024MP710)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_CH22
#    define ADC_CHANNEL_HAVE_CH23
#    define ADC_CHANNEL_HAVE_CH24
#    define ADC_CHANNEL_HAVE_CH25
#    define ADC_CHANNEL_HAVE_CH26
#    define ADC_CHANNEL_HAVE_CH27
#    define ADC_CHANNEL_HAVE_CH28
#    define ADC_CHANNEL_HAVE_CH29
#    define ADC_CHANNEL_HAVE_CH30
#    define ADC_CHANNEL_HAVE_CH31
#    define ADC_CHANNEL_HAVE_MASK 0xFFFFFFFFLU
#    define ADC_CHANNEL_COUNT     32
#    define ADC_CHANNEL_MAX       31
#elif defined(DEVICE_33EP16GS202) || defined(DEVICE_33EP32GS202)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_MASK 0x7FFFLU
#    define ADC_CHANNEL_COUNT     15
#    define ADC_CHANNEL_MAX       14
#elif defined(DEVICE_33EP16GS502) || defined(DEVICE_33EP32GS502) || defined(DEVICE_33EP64GS502)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x003C00FFLU
#    define ADC_CHANNEL_COUNT     12
#    define ADC_CHANNEL_MAX       21
#elif defined(DEVICE_33EP16GS504) || defined(DEVICE_33EP16GS505) || defined(DEVICE_33EP32GS504) || defined(DEVICE_33EP32GS505) || defined(DEVICE_33EP64GS504)  \
    || defined(DEVICE_33EP64GS505)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x003E5FFFLU
#    define ADC_CHANNEL_COUNT     19
#    define ADC_CHANNEL_MAX       21
#elif defined(DEVICE_33EP16GS506) || defined(DEVICE_33EP32GS506) || defined(DEVICE_33EP64GS506) || defined(DEVICE_33EP64GS708) || defined(DEVICE_33EP64GS806)  \
    || defined(DEVICE_33EP64GS808) || defined(DEVICE_33EP128GS706) || defined(DEVICE_33EP128GS708) || defined(DEVICE_33EP128GS806)                             \
    || defined(DEVICE_33EP128GS808)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH5
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH12
#    define ADC_CHANNEL_HAVE_CH13
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH15
#    define ADC_CHANNEL_HAVE_CH16
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x003FFFFFLU
#    define ADC_CHANNEL_COUNT     22
#    define ADC_CHANNEL_MAX       21
#elif defined(DEVICE_33EP64GS804) || defined(DEVICE_33EP64GS805) || defined(DEVICE_33EP128GS704) || defined(DEVICE_33EP128GS705)                               \
    || defined(DEVICE_33EP128GS804) || defined(DEVICE_33EP128GS805)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH8
#    define ADC_CHANNEL_HAVE_CH9
#    define ADC_CHANNEL_HAVE_CH10
#    define ADC_CHANNEL_HAVE_CH11
#    define ADC_CHANNEL_HAVE_CH14
#    define ADC_CHANNEL_HAVE_CH17
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x003E4FDFLU
#    define ADC_CHANNEL_COUNT     17
#    define ADC_CHANNEL_MAX       21
#elif defined(DEVICE_33EP128GS702)
#    define ADC_CHANNEL_HAVE_CH0
#    define ADC_CHANNEL_HAVE_CH1
#    define ADC_CHANNEL_HAVE_CH2
#    define ADC_CHANNEL_HAVE_CH3
#    define ADC_CHANNEL_HAVE_CH4
#    define ADC_CHANNEL_HAVE_CH6
#    define ADC_CHANNEL_HAVE_CH7
#    define ADC_CHANNEL_HAVE_CH18
#    define ADC_CHANNEL_HAVE_CH19
#    define ADC_CHANNEL_HAVE_CH20
#    define ADC_CHANNEL_HAVE_CH21
#    define ADC_CHANNEL_HAVE_MASK 0x003C00DFLU
#    define ADC_CHANNEL_COUNT     11
#    define ADC_CHANNEL_MAX       21
#endif

