UniSwarm/uDevkit-SDK/support/driver/adc/adc_dspic33_sar12.h
#define ADC_DIGITAL_OVR_128X_16BITS 0b111
#define ADC_DIGITAL_OVR_32X_15BITS  0b110
#define ADC_DIGITAL_OVR_8X_14BITS   0b101
#define ADC_DIGITAL_OVR_2X_13BITS   0b100
#define ADC_DIGITAL_OVR_256X_16BITS 0b011
#define ADC_DIGITAL_OVR_64X_15BITS  0b010
#define ADC_DIGITAL_OVR_16X_14BITS  0b001
#define ADC_DIGITAL_OVR_4X_13BITS   0b000

#define ADC_DIGITAL_AVG_256X 0b111
#define ADC_DIGITAL_AVG_128X 0b110
#define ADC_DIGITAL_AVG_64X  0b101
#define ADC_DIGITAL_AVG_32X  0b100
#define ADC_DIGITAL_AVG_16X  0b011
#define ADC_DIGITAL_AVG_8X   0b010
#define ADC_DIGITAL_AVG_4X   0b001
#define ADC_DIGITAL_AVG_2X   0b000

// ================================== TRIGGER sources ==================================
#ifdef ADC_CHANNEL_HAVE_CH0
#    define ADC_TRIGSRC00 ADTRIG0Lbits.TRGSRC0
#endif
#ifdef ADC_CHANNEL_HAVE_CH1
#    define ADC_TRIGSRC01 ADTRIG0Lbits.TRGSRC1
#endif
#ifdef ADC_CHANNEL_HAVE_CH2
#    define ADC_TRIGSRC02 ADTRIG0Hbits.TRGSRC2
#endif
#ifdef ADC_CHANNEL_HAVE_CH3
#    define ADC_TRIGSRC03 ADTRIG0Hbits.TRGSRC3
#endif
#ifdef ADC_CHANNEL_HAVE_CH4
#    define ADC_TRIGSRC04 ADTRIG1Lbits.TRGSRC4
#endif
#ifdef ADC_CHANNEL_HAVE_CH5
#    define ADC_TRIGSRC05 ADTRIG1Lbits.TRGSRC5
#endif
#ifdef ADC_CHANNEL_HAVE_CH6
#    define ADC_TRIGSRC06 ADTRIG1Hbits.TRGSRC6
#endif
#ifdef ADC_CHANNEL_HAVE_CH7
#    define ADC_TRIGSRC07 ADTRIG1Hbits.TRGSRC7
#endif
#ifdef ADC_CHANNEL_HAVE_CH8
#    define ADC_TRIGSRC08 ADTRIG2Lbits.TRGSRC8
#endif
#ifdef ADC_CHANNEL_HAVE_CH9
#    define ADC_TRIGSRC09 ADTRIG2Lbits.TRGSRC9
#endif
#ifdef ADC_CHANNEL_HAVE_CH10
#    define ADC_TRIGSRC10 ADTRIG2Hbits.TRGSRC10
#endif
#ifdef ADC_CHANNEL_HAVE_CH11
#    define ADC_TRIGSRC11 ADTRIG2Hbits.TRGSRC11
#endif
#ifdef ADC_CHANNEL_HAVE_CH12
#    define ADC_TRIGSRC12 ADTRIG3Lbits.TRGSRC12
#endif
#ifdef ADC_CHANNEL_HAVE_CH13
#    define ADC_TRIGSRC13 ADTRIG3Lbits.TRGSRC13
#endif
#ifdef ADC_CHANNEL_HAVE_CH14
#    define ADC_TRIGSRC14 ADTRIG3Hbits.TRGSRC14
#endif
#ifdef ADC_CHANNEL_HAVE_CH15
#    define ADC_TRIGSRC15 ADTRIG3Hbits.TRGSRC15
#endif
#ifdef ADC_CHANNEL_HAVE_CH16
#    define ADC_TRIGSRC16 ADTRIG4Lbits.TRGSRC16
#endif
#ifdef ADC_CHANNEL_HAVE_CH17
#    define ADC_TRIGSRC17 ADTRIG4Lbits.TRGSRC17
#endif
#ifdef ADC_CHANNEL_HAVE_CH18
#    define ADC_TRIGSRC18 ADTRIG4Hbits.TRGSRC18
#endif
#ifdef ADC_CHANNEL_HAVE_CH19
#    define ADC_TRIGSRC19 ADTRIG4Hbits.TRGSRC19
#endif
#ifdef ADC_CHANNEL_HAVE_CH20
#    define ADC_TRIGSRC20 ADTRIG5Lbits.TRGSRC20
#endif
#ifdef ADC_CHANNEL_HAVE_CH21
#    define ADC_TRIGSRC21 ADTRIG5Lbits.TRGSRC21
#endif
#ifdef ADC_CHANNEL_HAVE_CH22
#    define ADC_TRIGSRC22 ADTRIG5Hbits.TRGSRC22
#endif
#ifdef ADC_CHANNEL_HAVE_CH23
#    define ADC_TRIGSRC23 ADTRIG5Hbits.TRGSRC23
#endif
#ifdef ADC_CHANNEL_HAVE_CH24
#    define ADC_TRIGSRC24 ADTRIG6Lbits.TRGSRC24
#endif
#ifdef ADC_CHANNEL_HAVE_CH25
#    define ADC_TRIGSRC25 ADTRIG6Lbits.TRGSRC25
#endif
#ifdef ADC_CHANNEL_HAVE_CH26
#    define ADC_TRIGSRC26 ADTRIG6Hbits.TRGSRC26
#endif
#ifdef ADC_CHANNEL_HAVE_CH27
#    define ADC_TRIGSRC27 ADTRIG6Hbits.TRGSRC27
#endif
#ifdef ADC_CHANNEL_HAVE_CH28
#    define ADC_TRIGSRC28 ADTRIG7Lbits.TRGSRC28
#endif
#ifdef ADC_CHANNEL_HAVE_CH29
#    define ADC_TRIGSRC29 ADTRIG7Lbits.TRGSRC29
#endif
#ifdef ADC_CHANNEL_HAVE_CH30
#    define ADC_TRIGSRC30 ADTRIG7Hbits.TRGSRC30
#endif
#ifdef ADC_CHANNEL_HAVE_CH31
#    define ADC_TRIGSRC31 ADTRIG7Hbits.TRGSRC31
#endif

#if defined(DEVICE_33CH64MP202) || defined(DEVICE_33CH64MP203) || defined(DEVICE_33CH64MP205) || defined(DEVICE_33CH64MP206) || defined(DEVICE_33CH64MP208)    \
    || defined(DEVICE_33CH64MP502) || defined(DEVICE_33CH64MP503) || defined(DEVICE_33CH64MP505) || defined(DEVICE_33CH64MP506) || defined(DEVICE_33CH64MP508) \
    || defined(DEVICE_33CH128MP202) || defined(DEVICE_33CH128MP203) || defined(DEVICE_33CH128MP205) || defined(DEVICE_33CH128MP206)                            \
    || defined(DEVICE_33CH128MP208) || defined(DEVICE_33CH128MP502) || defined(DEVICE_33CH128MP503) || defined(DEVICE_33CH128MP505)                            \
    || defined(DEVICE_33CH128MP506) || defined(DEVICE_33CH128MP508) || defined(DEVICE_33CH256MP205) || defined(DEVICE_33CH256MP206)                            \
    || defined(DEVICE_33CH256MP208) || defined(DEVICE_33CH256MP505) || defined(DEVICE_33CH256MP506) || defined(DEVICE_33CH256MP508)                            \
    || defined(DEVICE_33CH512MP205) || defined(DEVICE_33CH512MP206) || defined(DEVICE_33CH512MP208) || defined(DEVICE_33CH512MP505)                            \
    || defined(DEVICE_33CH512MP506) || defined(DEVICE_33CH512MP508)
// CH primary code
#    define ADC_TRGSRC_ADTRG31        0b11111
#    define ADC_TRGSRC_PTG            0b11110
#    define ADC_TRGSRC_SLV_CLC1       0b11101
#    define ADC_TRGSRC_MSTR_CLC1      0b11100
#    define ADC_TRGSRC_SLV_PWM8_TRG2  0b11011
#    define ADC_TRGSRC_SLV_PWM5_TRG2  0b11010
#    define ADC_TRGSRC_SLV_PWM3_TRG2  0b11001
#    define ADC_TRGSRC_SLV_PWM1_TRG2  0b11000
#    define ADC_TRGSRC_MSTR_SCCP4     0b10111
#    define ADC_TRGSRC_MSTR_SCCP3     0b10110
#    define ADC_TRGSRC_MSTR_SCCP2     0b10101
#    define ADC_TRGSRC_MSTR_SCCP1     0b10100
#    define ADC_TRGSRC_MSTR_PWM4_TRG2 0b01011
#    define ADC_TRGSRC_MSTR_PWM4_TRG1 0b01010
#    define ADC_TRGSRC_MSTR_PWM3_TRG2 0b01001
#    define ADC_TRGSRC_MSTR_PWM3_TRG1 0b01000
#    define ADC_TRGSRC_MSTR_PWM2_TRG2 0b00111
#    define ADC_TRGSRC_MSTR_PWM2_TRG1 0b00110
#    define ADC_TRGSRC_MSTR_PWM1_TRG2 0b00101
#    define ADC_TRGSRC_MSTR_PWM1_TRG1 0b00100
#    define ADC_TRGSRC_SOFTTRG        0b00010
#    define ADC_TRGSRC_COMMONSOFTTRG  0b00001
#    define ADC_TRGSRC_NOTRIG         0b00000

#elif defined(DEVICE_33CH64MP202S1) || defined(DEVICE_33CH64MP203S1) || defined(DEVICE_33CH64MP205S1) || defined(DEVICE_33CH64MP206S1)                         \
    || defined(DEVICE_33CH64MP208S1) || defined(DEVICE_33CH64MP502S1) || defined(DEVICE_33CH64MP503S1) || defined(DEVICE_33CH64MP505S1)                        \
    || defined(DEVICE_33CH64MP506S1) || defined(DEVICE_33CH64MP508S1) || defined(DEVICE_33CH128MP202S1) || defined(DEVICE_33CH128MP203S1)                      \
    || defined(DEVICE_33CH128MP205S1) || defined(DEVICE_33CH128MP206S1) || defined(DEVICE_33CH128MP208S1) || defined(DEVICE_33CH128MP502S1)                    \
    || defined(DEVICE_33CH128MP503S1) || defined(DEVICE_33CH128MP505S1) || defined(DEVICE_33CH128MP506S1) || defined(DEVICE_33CH128MP508S1)                    \
    || defined(DEVICE_33CH256MP205S1) || defined(DEVICE_33CH256MP206S1) || defined(DEVICE_33CH256MP208S1) || defined(DEVICE_33CH256MP505S1)                    \
    || defined(DEVICE_33CH256MP506S1) || defined(DEVICE_33CH256MP508S1) || defined(DEVICE_33CH512MP205S1) || defined(DEVICE_33CH512MP206S1)                    \
    || defined(DEVICE_33CH512MP208S1) || defined(DEVICE_33CH512MP505S1) || defined(DEVICE_33CH512MP506S1) || defined(DEVICE_33CH512MP508S1)
// CH secondary code
#    define ADC_TRGSRC_ADTRG31        0b11111
#    define ADC_TRGSRC_MSTR_PTG       0b11110
#    define ADC_TRGSRC_SLV_CLC1       0b11101
#    define ADC_TRGSRC_MSTR_CLC1      0b11100
#    define ADC_TRGSRC_MSTR_PWM3_TRG2 0b11001
#    define ADC_TRGSRC_MSTR_PWM1_TRG2 0b11000
#    define ADC_TRGSRC_SLV_SCCP4      0b10111
#    define ADC_TRGSRC_SLV_SCCP3      0b10110
#    define ADC_TRGSRC_SLV_SCCP2      0b10101
#    define ADC_TRGSRC_SLV_SCCP1      0b10100
#    define ADC_TRGSRC_SLV_PWM8_TRG1  0b01111
#    define ADC_TRGSRC_SLV_PWM7_TRG1  0b01110
#    define ADC_TRGSRC_SLV_PWM6_TRG1  0b01101
#    define ADC_TRGSRC_SLV_PWM5_TRG1  0b01100
#    define ADC_TRGSRC_SLV_PWM4_TRG2  0b01011
#    define ADC_TRGSRC_SLV_PWM4_TRG1  0b01010
#    define ADC_TRGSRC_SLV_PWM3_TRG2  0b01001
#    define ADC_TRGSRC_SLV_PWM3_TRG1  0b01000
#    define ADC_TRGSRC_SLV_PWM2_TRG2  0b00111
#    define ADC_TRGSRC_SLV_PWM2_TRG1  0b00110
#    define ADC_TRGSRC_SLV_PWM1_TRG2  0b00101
#    define ADC_TRGSRC_SLV_PWM1_TRG1  0b00100
#    define ADC_TRGSRC_SOFTTRG        0b00010
#    define ADC_TRGSRC_COMMONSOFTTRG  0b00001
#    define ADC_TRGSRC_NOTRIG         0b00000

#elif defined(DEVICE_33CK32MC102) || defined(DEVICE_33CK32MC103) || defined(DEVICE_33CK32MC105) || defined(DEVICE_33CK64MC102) || defined(DEVICE_33CK64MC103)  \
    || defined(DEVICE_33CK64MC105) || defined(DEVICE_33CK32MP102) || defined(DEVICE_33CK32MP103) || defined(DEVICE_33CK32MP105) || defined(DEVICE_33CK64MP102) \
    || defined(DEVICE_33CK64MP103) || defined(DEVICE_33CK64MP105)
// CK MP1XX
#    define ADC_TRGSRC_ADTRG31       0b11111
#    define ADC_TRGSRC_PTG           0b11110
#    define ADC_TRGSRC_CLC4          0b10010
#    define ADC_TRGSRC_CLC3          0b10001
#    define ADC_TRGSRC_CLC2          0b11101
#    define ADC_TRGSRC_CLC1          0b11100
#    define ADC_TRGSRC_MCCP5         0b11000
#    define ADC_TRGSRC_SCCP4         0b10111
#    define ADC_TRGSRC_SCCP3         0b10110
#    define ADC_TRGSRC_SCCP2         0b10101
#    define ADC_TRGSRC_SCCP1         0b10100
#    define ADC_TRGSRC_MCCP5_TRG     0b10000
#    define ADC_TRGSRC_SCCP4_TRG     0b01111
#    define ADC_TRGSRC_SCCP3_TRG     0b01110
#    define ADC_TRGSRC_SCCP2_TRG     0b01101
#    define ADC_TRGSRC_SCCP1_TRG     0b01100
#    define ADC_TRGSRC_PWM4_TRG2     0b01011
#    define ADC_TRGSRC_PWM4_TRG1     0b01010
#    define ADC_TRGSRC_PWM3_TRG2     0b01001
#    define ADC_TRGSRC_PWM3_TRG1     0b01000
#    define ADC_TRGSRC_PWM2_TRG2     0b00111
#    define ADC_TRGSRC_PWM2_TRG1     0b00110
#    define ADC_TRGSRC_PWM1_TRG2     0b00101
#    define ADC_TRGSRC_PWM1_TRG1     0b00100
#    define ADC_TRGSRC_SOFTTRG       0b00010
#    define ADC_TRGSRC_COMMONSOFTTRG 0b00001
#    define ADC_TRGSRC_NOTRIG        0b00000

#elif defined(DEVICE_33CK32MP202) || defined(DEVICE_33CK32MP203) || defined(DEVICE_33CK32MP205) || defined(DEVICE_33CK32MP206) || defined(DEVICE_33CK32MP502)  \
    || defined(DEVICE_33CK32MP503) || defined(DEVICE_33CK32MP505) || defined(DEVICE_33CK32MP506) || defined(DEVICE_33CK64MP202) || defined(DEVICE_33CK64MP203) \
    || defined(DEVICE_33CK64MP205) || defined(DEVICE_33CK64MP206) || defined(DEVICE_33CK64MP208) || defined(DEVICE_33CK64MP502) || defined(DEVICE_33CK64MP503) \
    || defined(DEVICE_33CK64MP505) || defined(DEVICE_33CK64MP506) || defined(DEVICE_33CK64MP508) || defined(DEVICE_33CK128MP202)                               \
    || defined(DEVICE_33CK128MP203) || defined(DEVICE_33CK128MP205) || defined(DEVICE_33CK128MP206) || defined(DEVICE_33CK128MP208)                            \
    || defined(DEVICE_33CK128MP502) || defined(DEVICE_33CK128MP503) || defined(DEVICE_33CK128MP505) || defined(DEVICE_33CK128MP506)                            \
    || defined(DEVICE_33CK128MP508) || defined(DEVICE_33CK256MP202) || defined(DEVICE_33CK256MP203) || defined(DEVICE_33CK256MP205)                            \
    || defined(DEVICE_33CK256MP206) || defined(DEVICE_33CK256MP208) || defined(DEVICE_33CK256MP305) || defined(DEVICE_33CK256MP306)                            \
    || defined(DEVICE_33CK256MP308) || defined(DEVICE_33CK256MP405) || defined(DEVICE_33CK256MP406) || defined(DEVICE_33CK256MP408)                            \
    || defined(DEVICE_33CK256MP410) || defined(DEVICE_33CK256MP502) || defined(DEVICE_33CK256MP503) || defined(DEVICE_33CK256MP505)                            \
    || defined(DEVICE_33CK256MP506) || defined(DEVICE_33CK256MP508) || defined(DEVICE_33CK256MP605) || defined(DEVICE_33CK256MP606)                            \
    || defined(DEVICE_33CK256MP608) || defined(DEVICE_33CK256MP705) || defined(DEVICE_33CK256MP706) || defined(DEVICE_33CK256MP708)                            \
    || defined(DEVICE_33CK256MP710) || defined(DEVICE_33CK256MPT608) || defined(DEVICE_33CK512MP305) || defined(DEVICE_33CK512MP306)                           \
    || defined(DEVICE_33CK512MP308) || defined(DEVICE_33CK512MP405) || defined(DEVICE_33CK512MP406) || defined(DEVICE_33CK512MP408)                            \
    || defined(DEVICE_33CK512MP410) || defined(DEVICE_33CK512MP605) || defined(DEVICE_33CK512MP606) || defined(DEVICE_33CK512MP608)                            \
    || defined(DEVICE_33CK512MP705) || defined(DEVICE_33CK512MP706) || defined(DEVICE_33CK512MP708) || defined(DEVICE_33CK512MP710)                            \
    || defined(DEVICE_33CK512MPT608) || defined(DEVICE_33CK1024MP405) || defined(DEVICE_33CK1024MP406) || defined(DEVICE_33CK1024MP408)                        \
    || defined(DEVICE_33CK1024MP410) || defined(DEVICE_33CK1024MP705) || defined(DEVICE_33CK1024MP706) || defined(DEVICE_33CK1024MP708)                        \
    || defined(DEVICE_33CK1024MP710)
// CK MP2/3/5/6/7XX
#    define ADC_TRGSRC_ADTRG31       0b11111
#    define ADC_TRGSRC_PTG           0b11110
#    define ADC_TRGSRC_CLC2          0b11101
#    define ADC_TRGSRC_CLC1          0b11100
#    define ADC_TRGSRC_MCCP9         0b11011
#    define ADC_TRGSRC_SCCP7         0b11010
#    define ADC_TRGSRC_SCCP6         0b11001
#    define ADC_TRGSRC_SCCP5         0b11000
#    define ADC_TRGSRC_SCCP4         0b10111
#    define ADC_TRGSRC_SCCP3         0b10110
#    define ADC_TRGSRC_SCCP2         0b10101
#    define ADC_TRGSRC_SCCP1         0b10100
#    define ADC_TRGSRC_PWM8_TRG2     0b10011
#    define ADC_TRGSRC_PWM8_TRG1     0b10010
#    define ADC_TRGSRC_PWM7_TRG2     0b10001
#    define ADC_TRGSRC_PWM7_TRG1     0b10000
#    define ADC_TRGSRC_PWM6_TRG2     0b01111
#    define ADC_TRGSRC_PWM6_TRG1     0b01110
#    define ADC_TRGSRC_PWM5_TRG2     0b01101
#    define ADC_TRGSRC_PWM5_TRG1     0b01100
#    define ADC_TRGSRC_PWM4_TRG2     0b01011
#    define ADC_TRGSRC_PWM4_TRG1     0b01010
#    define ADC_TRGSRC_PWM3_TRG2     0b01001
#    define ADC_TRGSRC_PWM3_TRG1     0b01000
#    define ADC_TRGSRC_PWM2_TRG2     0b00111
#    define ADC_TRGSRC_PWM2_TRG1     0b00110
#    define ADC_TRGSRC_PWM1_TRG2     0b00101
#    define ADC_TRGSRC_PWM1_TRG1     0b00100
#    define ADC_TRGSRC_SOFTTRG       0b00010
#    define ADC_TRGSRC_COMMONSOFTTRG 0b00001
#    define ADC_TRGSRC_NOTRIG        0b00000
#endif

#ifdef __cplusplus
}
#endif

#endif  // ADC_DSPIC33_SAR12_H
